{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences500","layers":[{"class_name":"Dense","config":{"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense65","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense66","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense67","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense68","trainable":true}},{"class_name":"Dense","config":{"units":14,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense69","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences500.weights.bin"],"weights":[{"name":"dense_Dense65/kernel","shape":[512,2],"dtype":"float32"},{"name":"dense_Dense65/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense66/kernel","shape":[2,50],"dtype":"float32"},{"name":"dense_Dense66/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense67/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense67/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense68/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense68/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense69/kernel","shape":[1,14],"dtype":"float32"}]}]}