{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences1","layers":[{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense38","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense39","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense40","trainable":true}},{"class_name":"Dense","config":{"units":400,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense41","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences1.weights.bin"],"weights":[{"name":"dense_Dense38/kernel","shape":[512,50],"dtype":"float32"},{"name":"dense_Dense38/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense39/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense39/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense40/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense40/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense41/kernel","shape":[1,400],"dtype":"float32"}]}]}