{"modelTopology":{"class_name":"Sequential","config":{"name":"confidences2","layers":[{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense63","trainable":true,"batch_input_shape":[null,512],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout46","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense64","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout47","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense65","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout48","trainable":true}},{"class_name":"Dense","config":{"units":14,"activation":"softmax","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense66","trainable":true}}]},"keras_version":"tfjs-layers 3.8.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.8.0","convertedBy":null,"weightsManifest":[{"paths":["./confidences2.weights.bin"],"weights":[{"name":"dense_Dense63/kernel","shape":[512,50],"dtype":"float32"},{"name":"dense_Dense63/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense64/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense64/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense65/kernel","shape":[20,1],"dtype":"float32"},{"name":"dense_Dense65/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense66/kernel","shape":[1,14],"dtype":"float32"}]}]}